Tekla.Structures.DirectManipulation.Adapter.Session.JsonBinder
The Tekla.Structures.DirectManipulation.Adapter.Session.JsonBinder class is used to bind the types during JSON serialization.

Tekla.Structures.DirectManipulation.Adapter.Session.JsonBinder.BindToType(System.String,System.String)
When overridden in a derived class, controls the binding of a serialized object to a type.
assemblyName: Specifies the System.Reflection.Assembly name of the serialized object.
typeName: Specifies the System.Type name of the serialized object.
Returns:
The type of the object the formatter creates a new instance of.